<img src="SQLite_logo.png" width="500" height="300" align="right"/>

# SQL: Delete

In [1]:
import pandas as pd
import sqlite3 as sql

In [2]:
to_server = r'.\My_Customer_Warehouse.db'
conn = sql.connect(to_server)
c = conn.cursor()

# See tables

In [3]:
c.execute("SELECT name FROM sqlite_master WHERE type='table';")
c.fetchall()

[('agents',),
 ('company',),
 ('customer',),
 ('daysorder',),
 ('deliveries',),
 ('foods',),
 ('listofitem',),
 ('student',),
 ('studentreport',),
 ('customer_analytics',),
 ('Income_Expense_Data',),
 ('online_shoppers_intention',),
 ('orders',)]

In [4]:
result = pd.read_sql('select * from orders', conn)
result.head()

,index,ORD_NUM,ORD_AMOUNT,ADVANCE_AMOUNT,ORD_DATE,CUST_CODE,AGENT_CODE,ORD_DESCRIPTION,diff
0,0,200100,1000,600,2008-01-08,C00015,A003,SOD\r,400
1,1,200110,3001,500,2008-04-15,C00019,A010,SOD\r,2501
2,2,200107,4500,900,2008-08-30,C00007,A010,SOD\r,3600
3,3,200112,2000,400,2008-05-30,C00016,A007,SOD\r,1600
4,4,200113,4000,600,2008-06-10,C00022,A002,SOD\r,3400

## Create new table

## Using execute Method

### Example Queries

In [5]:
delete=['DELETE FROM orders WHERE diff < 1000']

drop=["DROP TABLE orders_diff"]

In [6]:
c.execute(delete[0])

In [7]:
result = pd.read_sql('select * from orders', conn)
result.head()

,index,ORD_NUM,ORD_AMOUNT,ADVANCE_AMOUNT,ORD_DATE,CUST_CODE,AGENT_CODE,ORD_DESCRIPTION,diff
0,1,200110,3001,500,2008-04-15,C00019,A010,SOD\r,2501
1,2,200107,4500,900,2008-08-30,C00007,A010,SOD\r,3600
2,3,200112,2000,400,2008-05-30,C00016,A007,SOD\r,1600
3,4,200113,4000,600,2008-06-10,C00022,A002,SOD\r,3400
4,5,200102,2000,300,2008-05-25,C00012,A012,SOD\r,1700

## Create new table

In [8]:
df_orders = pd.read_sql('select * from orders', conn)
df_orders['diff'] = df_orders['ORD_AMOUNT']- df_orders['ADVANCE_AMOUNT']
df_orders.to_sql('orders_diff', con=conn, if_exists='replace', index=False)

In [9]:
c.execute("SELECT name FROM sqlite_master WHERE type='table';")
c.fetchall()

[('agents',),
 ('company',),
 ('customer',),
 ('daysorder',),
 ('deliveries',),
 ('foods',),
 ('listofitem',),
 ('student',),
 ('studentreport',),
 ('customer_analytics',),
 ('Income_Expense_Data',),
 ('online_shoppers_intention',),
 ('orders',),
 ('orders_diff',)]

### Drop new table

In [10]:
c.execute(drop[0])

In [11]:
c.execute("SELECT name FROM sqlite_master WHERE type='table';")
c.fetchall()

[('agents',),
 ('company',),
 ('customer',),
 ('daysorder',),
 ('deliveries',),
 ('foods',),
 ('listofitem',),
 ('student',),
 ('studentreport',),
 ('customer_analytics',),
 ('Income_Expense_Data',),
 ('online_shoppers_intention',),
 ('orders',)]

In [12]:
conn.commit()
conn.close()